export type TAccessoriesItem = {
  src: string
  label: string
  price: number
  quantity: number
  id: number
  address: string
  category: string
}

export let dataAccessories = [
  {
    src: '/Accessories/Keyboards/1.png',
    label: 'MSI Vigor GK30 White',
    price: 3499,
    quantity: 3,
    id: 10,
    address: 'MSI-Vigor',
    category: 'Keyboards',
    text: 'Клавиатура проводная MSI Vigor GK30 White принадлежит к модельному ряду игровых устройств и выделяется красочной многоцветной подсветкой. Она обладает полноразмерной раскладкой и позволяет вводить комбинации из 6 клавиш одновременно. MSI Vigor GK30 White выполнена в элегантном белом корпусе. В конструкции реализована защита от воздействия влаги. Подставка под запястья повышает комфорт при продолжительных игровых сеансах. К компьютеру клавиатура подключается посредством кабеля с позолоченным коннектором USB и длиной 1.8 метра.',
  },
  {
    src: '/Accessories/Keyboards/2.png',
    label: 'Dark Project KD83A',
    price: 9699,
    quantity: 3,
    id: 20,
    address: 'Dark-Project',
    category: 'Keyboards',
    text: 'Клавиатура Dark Project KD83A – модель компактного форм-фактора с механическими переключателями Gateron Cap Teal, которые отличаются высокой точностью ввода и быстрым откликом на нажатия пользователя. Светодиодная подсветка RGB освещает кнопки в темноте яркими цветами и создает комфортные условия для погружения в игровой процесс. Клавиатура Dark Project KD83A оборудована 83 клавишами и обладает прочной конструкцией, устойчивой к механическим воздействиям. Для подключения клавиатуры к компьютеру имеется кабель длиной 1.8 метров с разъемом USB.',
  },
  {
    src: '/Accessories/Mouse/1.png',
    label: 'Logitech G102 LIGHTSYNC',
    price: 2550,
    quantity: 3,
    id: 30,
    address: 'Logitech-G102',
    category: 'Mouse',
    text: 'Мышь проводная Logitech Gaming Mouse G102 LIGHTSYNC 8000dpi выделяется необычным цветовым оформлением, высокопроизводительным оснащением и гибкими возможностями управления. В данной модели установлен оптический светодиодный сенсор, разрешение которого регулируется до 8000 dpi. Он обеспечивает точность и скорость позиционирования курсора в играх любого жанра. Средствами фирменного приложения Logitech G HUB вы сможете настраивать различные игровые команды и назначать функциональность кнопкам. Эргономичная симметричная форма корпуса оптимизирована для одинаково удобного хвата правой или левой рукой. Подключение манипулятора Logitech Gaming Mouse G102 LIGHTSYNC осуществляется проводным способом посредством разъема USB. Кабель характеризуется длиной 2.1 м и износостойкой оплеткой.',
  },
  {
    src: '/Accessories/Mouse/2.png',
    label: 'ARDOR GAMING Fury',
    price: 1750,
    quantity: 3,
    id: 40,
    address: 'ARDOR-GAMING-Fury',
    category: 'Mouse',
    text: 'Мышь проводная ARDOR GAMING Fury [ARD-FURY3327-BK] собрана в эффектно выглядящем эргономичном корпусе, рассчитанном на хват правой рукой. Манипулятор украшен эффектной разноцветной подсветкой. Мышь ориентирована на совместное использование с игровыми стационарными компьютерами и ноутбуками. Модель оснащена оптическим светодиодным датчиком PixArt PMW3327, обеспечивающим разрешение до 12400 dpi. Такая точность позиционирования курсора прежде всего актуальна в динамичных видеоиграх. Мышь способна выдерживать ускорение до 30 G. Частота опроса датчика типична – 1000 Гц.Мышь проводная ARDOR GAMING Fury [ARD-FURY3327-BK] оснащена 7 кнопками, 6 из которых могут программироваться. Для соединения устройства с ПК используется интерфейс USB. Длина кабеля, составляющая 180 см, в подавляющем большинстве случаев гарантирует отсутствие сложностей с подключением.Материал корпуса мыши – приятный на ощупь матовый пластик. Несмотря на довольно существенные размеры (73x41x131 мм), устройство отличается легкостью. Масса мыши составляет лишь 95 г. Манипулятор имеет практичный черный цвет',
  },
  {
    src: '/Accessories/Headsets/1.png',
    label: 'Fifine H6',
    price: 3499,
    quantity: 3,
    id: 50,
    address: 'Fifine-H6',
    category: 'Headsets',
    text: 'Проводная гарнитура Fifine H6 ‒ игровое устройство с охватывающими мягкими амбушюрами. Мягкие чашки плотно прилегают к ушным каналам, не шатаются. Оголовье и амбушюры обтянуты экокожей. Благодаря хорошему прижиму вы получаете пассивную звукоизоляцию, в результате чего утечки басов не будет. Активация подсветки чашек происходит при отключении микрофона. При необходимости микрофон можно снять или отодвинуть. При показателе чувствительности микрофона -40 вы не будете ощущать помех и посторонних шумов.',
  },
  {
    src: '/Accessories/Headsets/2.png',
    label: 'Logitech G435',
    price: 7999,
    quantity: 3,
    id: 60,
    address: 'Logitech-G435',
    category: 'Headsets',
    text: 'Беспроводные наушники Logitech G435 оснащены охватывающими амбушюрами с мягким наполнителем, которые вместе с регулируемым оголовьем обеспечат комфортную посадку на голове. Устройство поддерживает две технологии беспроводного подключения: Bluetooth и радиоканал. Они позволят использовать модель вместе со смартфонами, компьютерами и прочей цифровой техникой, включая игровые консоли PlayStation 4, PlayStation 5 и Nintendo Switch. За воспроизведение громкого, детализированного и сбалансированного звука в диапазоне частот 20-20000 Гц отвечают динамические излучатели с мембранами диаметром 40 мм.',
  },
  {
    src: '/Accessories/Monitors/1.png',
    label: 'ARDOR GAMING PORTAL AF24H1',
    price: 14999,
    quantity: 3,
    id: 70,
    address: 'ARDOR-GAMING-PORTAL-AF24H1',
    category: 'Monitors',
    text: 'Игровой монитор ARDOR GAMING PORTAL AF24H1 представлен в стильном черном корпусе с функциональной подставкой и динамиками по 2 Вт. Экран 23.8” радует яркой и четкой картинкой, которая не зависает в динамичных сценах. Это позволяет с удовольствием смотреть фильмы в FullHD-разрешении и точно управлять игровым персонажем. Монитор дополнен защитой от бликов, синего свечения и мерцания.ARDOR GAMING PORTAL AF24H1 идет в комплекте с набором кабелей в органайзере, стикером с фирменным логотипом, отверткой и салфеткой. Вы можете заменять встроенные динамики наушниками или колонками с подключением через стандартный аудиоразъем.',
  },
  {
    src: '/Accessories/Monitors/2.png',
    label: 'MSI Optix G24C4',
    price: 16750,
    quantity: 3,
    id: 80,
    address: 'MSI-Optix-G24C4',
    category: 'Monitors',
    text: 'Монитор MSI Optix G24C4 с диагональю 23.6" является игровым монитором. Он выполнен в черном цвете и устанавливается на устойчивую подставку. Основой монитора служит VA-панель, особенность которой в поддержке показателя частоты обновления, соответствующего 144 Гц, и времени отклика 1 мс. Такие параметры способствуют получению реалистичного и максимально четкого изображения, которое поможет вам ощутить себя погруженным полностью в игровой мир. Разрешение изображения будет соответствовать 1920x1080.',
  },
]
